Autodesk.Revit.DB.ATFGBXMLExportOptions.SetTrf(Autodesk.Revit.DB.Transform)
Sets the transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.GetTrf
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.ProductVersion
Returns the product version.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.ProductName
Returns the product name.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.RequestAnalysisOutputInStandardInternationalUnits
Should the reports use standard international units?
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.BuildingAnalysisParametersJSON
The JSON with building level analisys parameters.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.GUID
The GUID entity of the file.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.URI
The URI path to the file.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.BuildingName
The name of the building.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.BuildingArea
The area of the building.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.BuildingType
The type of the building.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.Elevation
Height above sea level.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.Latitude
Degrees north of the equator, in decimal degrees. Locations south of the equator are negative.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.Longitude
Degrees east of Greenwich, in decimal degrees. Locations west of Greenwich are negative.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.ZipcodeOrPostalCode
The location zipcode or postal code.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.LocationName
The location name.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.StationId
The location station id.
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions.#ctor
Since:
2026

Autodesk.Revit.DB.ATFGBXMLExportOptions
ATF gbXML Export options.
Since:
2026